In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data={'state':['AP','TN','TL','MP','UP','GUJ'],'year':[1956,1947,2014,1951,1950,1965],'gdp':[4500,7000,6500,4000,5000,8000]}

In [5]:
print(data)

{'state': ['AP', 'TN', 'TL', 'MP', 'UP', 'GUJ'], 'year': [1956, 1947, 2014, 1951, 1950, 1965], 'gdp': [4500, 7000, 6500, 4000, 5000, 8000]}

In [6]:
df1=pd.DataFrame(data)

In [7]:
df1

  state  year   gdp
0    AP  1956  4500
1    TN  1947  7000
2    TL  2014  6500
3    MP  1951  4000
4    UP  1950  5000
5   GUJ  1965  8000

In [9]:
df2=pd.DataFrame(data,columns=['year','state','gdp','debt'],index=['one','two','three','four','five','six'])

In [10]:
df2

       year state   gdp debt
one    1956    AP  4500  NaN
two    1947    TN  7000  NaN
three  2014    TL  6500  NaN
four   1951    MP  4000  NaN
five   1950    UP  5000  NaN
six    1965   GUJ  8000  NaN

In [11]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [12]:
df2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [13]:
df2.columns

Index(['year', 'state', 'gdp', 'debt'], dtype='object')

In [14]:
pd.isnull(df2)

        year  state    gdp  debt
one    False  False  False  True
two    False  False  False  True
three  False  False  False  True
four   False  False  False  True
five   False  False  False  True
six    False  False  False  True

In [16]:
#checking null values

In [20]:
pd.isnull(df2).sum()

year     0
state    0
gdp      0
debt     6
dtype: int64

In [18]:
df2.isnull().sum()

year     0
state    0
gdp      0
debt     6
dtype: int64

#df2.isnull().sum() gives the count of null values in each column inthe dataframe.

pd.isnull(df2).sum() also works.

In [54]:
obj=pd.Series(range(1,4),index=['a','b','c'])

In [55]:
obj

a    1
b    2
c    3
dtype: int64

In [56]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [57]:
Index1=obj.index

In [58]:
Index1[0]

'a'

In [59]:
obj.index[1]

'b'

#Index1[1]=25.

you cant reassign index.

Index doesnt not support mutable operations.

In [60]:
obj[0]

1

In [48]:
obj

a    0
b    1
c    2
dtype: int64

# Creating Index

In [30]:
labels=pd.Index(np.arange(3))

In [31]:
obj2=pd.Series([1.5,2,3.5],index=labels)

In [32]:
obj2

0    1.5
1    2.0
2    3.5
dtype: float64

In [33]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [36]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [37]:
labels is obj2.index

True

# re indexing will only change it & rearrange the index but the original will be intact.

In [43]:
obj2.reindex([2,0,1,5])

2    3.5
0    1.5
1    2.0
5    NaN
dtype: float64

In [44]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [45]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [46]:
obj2

0    1.5
1    2.0
2    3.5
dtype: float64

# Dataframe

In [65]:
df3=pd.DataFrame(np.arange(9).reshape(-1,3),index=['a','b','c'],columns=['Ohio','Texas','California'])

In [66]:
df3

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

#you can define the rows or columns in the reshape to -1 if u dont know their size or count.
Python will reshape accordingly.

In [67]:
df3.drop('a')

   Ohio  Texas  California
b     3      4           5
c     6      7           8

In [68]:
df3

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

#df3.drop() drops the index & its corresponding values temporarily.
#to drop permanently u need to have inplace=True

In [69]:
df3.drop('a',inplace=True)

In [70]:
df3

   Ohio  Texas  California
b     3      4           5
c     6      7           8

In [71]:
#similarly to drop a column & its corrsponding values u need to have
#df3.drop('Ohio',axis=1) or df3.drop('Ohio',axis=columns). inplace=True should be there to delete permanently.

In [72]:
df3.drop('Ohio',axis=1)

   Texas  California
b      4           5
c      7           8

In [73]:
df3

   Ohio  Texas  California
b     3      4           5
c     6      7           8

In [76]:
df3.drop('Ohio',axis='columns')

   Texas  California
b      4           5
c      7           8

In [77]:
df3

   Ohio  Texas  California
b     3      4           5
c     6      7           8

In [78]:
df3.drop('Ohio',axis='columns',inplace=True)

In [79]:
df3

   Texas  California
b      4           5
c      7           8

In [82]:
df3['Texas']

b    4
c    7
Name: Texas, dtype: int64

In [83]:
df3[['Texas','California']]

   Texas  California
b      4           5
c      7           8

In [90]:
#df3[0] indexing doesnt work

In [92]:
df3[0:]

   Texas  California
b      4           5
c      7           8

In [93]:
#slicing works